PeterVranken/DEVKIT-MPC5748G/samples/safe-RTOS/code/application/triCore/Z4B/m4b_mainZ4B.c
/**
 * @file m4b_mainZ4B.c
 * C entry function for the second core running safe-RTOS. By compile-time configuration,
 * this can be either the Z4B or the Z2. The main function starts the safe-RTOS kernel on
 * the chosen core.\n
 *   Two regular tasks are spinning and driving an LED each. A third LED is commanded by
 * the idle task. Only if three LEDs are blinking everything is alright.\n
 *   Progress information is permanently written into the serial output channel. A terminal
 * on the development host needs to use these settings: 115000 Bd, 8 Bit data word, no
 * parity, 1 stop bit.
 *
 * Copyright (C) 2018-2024 Peter Vranken (mailto:Peter_Vranken@Yahoo.de)
 *
 * This program is free software: you can redistribute it and/or modify it
 * under the terms of the GNU Lesser General Public License as published by the
 * Free Software Foundation, either version 3 of the License, or any later
 * version.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU Lesser General Public License
 * for more details.
 *
 * You should have received a copy of the GNU Lesser General Public License
 * along with this program. If not, see <http://www.gnu.org/licenses/>.
 */
/* Module interface
 *   m4b_injectError
 *   m4b_onButtonChangeCallback
 *   m4b_mainZ4B
 * Local functions
 *   taskInitProcess
 *   taskNotificationFromZ2
 *   taskNotificationFromZ4A
 *   task1ms
 *   taskOs1ms
 */

/*
 * Include files
 */

#include <stdlib.h>
#include <stdio.h>
#include <string.h>
#include <math.h>
#include <assert.h>

#include "MPC5748G.h"
#include "typ_types.h"
#include "ccl_configureClocks.h"
#include "xbs_crossbarSwitch.h"

#include "rtos.h"
#include "gsl_systemLoad.h"
#include "lbd_ledAndButtonDriver.h"
#include "sio_serialIO.h"
#include "del_delay.h"
#include "stm_systemTimer.h"
#include "syc_systemConfiguration.h"
#include "mz2_mainZ2.h"
#include "m4b_mainZ4B.h"


/*
 * Defines
 */
 
/** The demo can be compiled with a ground load. Most tasks produce some CPU load if this
    switch is set to 1. */
#define TASKS_PRODUCE_GROUND_LOAD   1


/*
 * Local type definitions
 */

/** The enumeration of all event processors, tasks and priorities, to have them as symbols
    in the source code. Most relevant are the event IDs. Actually, these IDs are provided
    by the RTOS at runtime, when creating the event. However, it is guaranteed that the
    IDs, which are dealt out by rtos_osCreateEventProcessor() form the series 0, 1, 2, ....
    So we don't need to have a dynamic storage of the IDs; we define them as constants and
    double-check by assertion that we got the correct, expected IDs from
    rtos_osCreateEventProcessor(). Note, this requires that the order of creating the event
    processors follows the order here in the enumeration.\n
      Here, we have the IDs of the created event processors. They occupy the index range
    starting from zero. */
enum
{
    /** Regular timer event. */
    idEvProc1ms = 0,

    /** This event processor is used for a notification from Z2: Core Z2 will use the
        inter-core notification driver to trigger this event processor and thus to activate
        a task on this core Z4B. */
    idEvProcNotificationFromZ2,
    
    /** This event processor is used for a notification from Z4A: Core Z4A will use the
        inter-core notification driver to trigger this event processor and thus to activate
        a task on this core Z4B. */
    idEvProcNotificationFromZ4A,
    
    /** The number of tasks to register. */
    noRegisteredEvProcs
};

_Static_assert( M4B_ID_EV_PROC_NOTIFICATION_FROM_Z2 == idEvProcNotificationFromZ2
                &&  M4B_ID_EV_PROC_NOTIFICATION_FROM_Z4A == idEvProcNotificationFromZ4A
              , "Inconsistency between public API and internal implementation"
              );

/** The RTOS uses constant priorities for its events, which are defined here.\n
    Note, the priority is a property of an event (processor) rather than of a task. A task
    implicitly inherits the priority of the event processor it is associated with. */
enum
{
    prioTaskIdle = 0,            /* Prio 0 is implicit, cannot be chosen explicitly */
    prioEv1ms,
    prioEvNotificationFromZ2,
    prioEvNotificationFromZ4A = prioEvNotificationFromZ2,
};


/** In safe-RTOS a task belongs to a process, characterized by the PID, 1..4. The
    relationship is defined here.\n
      Note, a process needs to be configured in the linker script (actually: assignment of
    stack space) before it can be used. */
enum
{
    pidOs = 0,              /* kernel always and implicitly has PID 0 */
    pidTaskNotificationFromZ2 = 1, /// @todo Shall we use P3? Just for testing?
    pidTaskNotificationFromZ4A = 1,
    pidTask1ms = 1,         /* Don't use P2, there are failures injected in core 0 */
    pidTaskOs1ms = pidOs,   /* A kernel or operating system task, e.g., to implement a
                               polling I/O driver. */
    pidTaskIdle = pidOs     /* PID 0 is implicit, idle belongs to the kernel */
};


/*
 * Local prototypes
 */


/*
 * Data definitions
 */

/** Counter of notification task activations, triggered by other core Z2 using the
    inter-core notification driver. */
volatile unsigned long UNCACHED_P1(m4b_cntTaskNotificationFromZ2) = 0;

/** Counter of notification task activations, triggered by other core Z4A using the
    inter-core notification driver. */
volatile unsigned long UNCACHED_P1(m4b_cntTaskNotificationFromZ4A) = 0;

/** Counter of notifications received from other core Z4A using the inter-core notification
    driver. Note that this is not necessarily identical to the number of task activations. */
volatile unsigned long UNCACHED_P1(m4b_cntNotificationsFromZ4A) = 0;

/** Counter of cyclic 1ms user task. */
volatile unsigned long SECTION(.uncached.P1.m4b_cntTask1ms) m4b_cntTask1ms = 0;  

/** Counter of cyclic 1ms OS task. */
volatile unsigned long SECTION(.uncached.OS.m4b_cntTaskOs1ms) m4b_cntTaskOs1ms = 0;

/** Counter of cycles of infinite main loop. */
volatile unsigned long SECTION(.uncached.OS.m4b_cntTaskIdle) m4b_cntTaskIdle = 0;

/** Total counter of task failures in P1 on second core. */
volatile unsigned int SECTION(.uncached.OS.m4b_cntTaskFailuresP1) m4b_cntTaskFailuresP1 = 0;

/** Activation loss counter for process 1 on the second core. */
volatile unsigned int SECTION(.uncached.OS.m4b_cntActivationLossFailures)
                                                        m4b_cntActivationLossFailures = 0;

/** Stack reserve of process p1 on the second core. */
volatile unsigned int SECTION(.uncached.OS.m4b_stackReserveP1) m4b_stackReserveP1 = 0;

/** Stack reserve of kernel process on the second core. */
volatile unsigned int SECTION(.uncached.OS.m4b_stackReserveOS) m4b_stackReserveOS = 0;

/** The average CPU load produced by all tasks and interrupts in tens of percent. */ 
volatile unsigned int SECTION(.uncached.OS.m4b_cpuLoadZ4B) m4b_cpuLoadZ4B = 1000;


