PeterVranken/DEVKIT-MPC5748G/samples/safe-RTOS/code/application/triCore/Z4B/m4b_mainZ4B.c
/*
 * Function implementation
 */


/**
 * Initialization task of process \a PID.
 *   @return
 * The function returns the Boolean descision, whether the initialization was alright and
 * the system can start up. "Not alright" is expressed by a negative number, which hinders
 * the RTOS to startup.
 *   @param PID
 * The ID of the process, the task function is executed in.
 *   @remark
 * In this sample, we demonstrate that different processes' tasks can share the same task
 * function implementation. This is meant a demonstration of the technical feasibility but
 * not of good practice; the implementation needs to use shared memory, which may break a
 * safety constraint, and it needs to consider the different privileges of the processes.
 */
static int32_t taskInitProcess(uint32_t PID)
{
    static unsigned int SHARED(cnt_) = 0;
    ++ cnt_;

    return cnt_ == PID? 0: -1;

} /* End of taskInitProcess */



/**
 * Task function, activated by notification 0, sent from core Z2. The notification
   announces the transfer of some (test) data from the other core.
 *   @return
 * If the task function returns a negative value then the task execution is counted as
 * error in the process.
 *   @param PID
 * A user task function gets the process ID as first argument.
 *   @param notificationParam
 * The task parameter is sent by core Z2 as parameter of the notification. Here, in this
 * sample it is a checksum to enable test of data correctness.
 */
static int32_t taskNotificationFromZ2( uint32_t PID ATTRIB_UNUSED
                                     , uint32_t notificationParam
                                     )
{
    /* Note, the while construct ensures that the assertion is working even in PRODUCTION
       build. */
    while(notificationParam != m4b_cntTaskNotificationFromZ2)
        assert(false);

    /* Make activations of the task observable in the debugger. */
    ++ m4b_cntTaskNotificationFromZ2;

    return 0;

} /* End of taskNotificationFromZ2 */



/**
 * Task function, activated by notification 1, sent from core Z4A. The notification
 * announces the transfer of some (test) data from the other core.
 *   @return
 * If the task function returns a negative value then the task execution is counted as
 * error in the process.
 *   @param PID
 * A user task function gets the process ID as first argument.
 *   @param taskParam
 * Notification 1 uses countable events. The task parameter is sent to the bit mask holding
 * the multiplicities of all events, which are potentially sent to this task.
 */
static int32_t taskNotificationFromZ4A( uint32_t PID ATTRIB_UNUSED
                                      , uint32_t taskParam
                                      )
{
    /* Make activations of the task observable in the debugger. */
    ++ m4b_cntTaskNotificationFromZ4A;

    const uint32_t noEvents = (taskParam & M2B_EV_MASK_NOTIFICATION_FROM_Z4A)
                              >> M2B_EV_SHFT_NOTIFICATION_FROM_Z4A;
    m4b_cntNotificationsFromZ4A += noEvents;

    /* Due to asynchronous execution of cores and their tasks, the number of received
       events will always stay behind the number of sent ones. However, there must be no
       drift. We check for a constant yet arbitrarily chosen upper bounds of the
       difference.
         diff == ULONG_MAX: The event sender can't notify the event and increment its
       counter in an operation, which would be atomic from the perspective of the other
       core. Occasionally, it may check the counter before it could be incremented.
         Note, the while construct ensures that the assertion is working even in PRODUCTION
       build. */
    const unsigned long diffCnt = syc_cntNotificationsToZ4B - m4b_cntNotificationsFromZ4A;
    while(diffCnt > 10u  &&  diffCnt != ULONG_MAX)
        assert(false);

    return 0;

} /* End of taskNotificationFromZ4A */



/**
 * Task function, cyclically activated every Millisecond. The LED D4 is switched on and off.
 *   @return
 * If the task function returns a negative value then the task execution is counted as
 * error in the process.
 *   @param PID
 * A user task function gets the process ID as first argument.
 *   @param taskParam
 * A variable task parameter. Here just used for testing.
 */
static int32_t task1ms(uint32_t PID ATTRIB_UNUSED, uint32_t taskParam ATTRIB_DBG_ONLY)
{
    assert(taskParam == 0);

    /* Make spinning of the task observable in the debugger. */
    ++ m4b_cntTask1ms;

#if TASKS_PRODUCE_GROUND_LOAD == 1
    /* Produce a bit of CPU load. This call simulates some true application software. */
    del_delayMicroseconds(/* fullLoadThisNoMicroseconds */ 50 /* approx. 5% load */);
#endif

    static int SBSS_P1(cntIsOn_) = 0;
    if(++cntIsOn_ >= 500)
        cntIsOn_ = -500;
    lbd_setLED(lbd_led_2_DS9, /* isOn */ cntIsOn_ >= 0);

    /* Inject an error from time to time. */
    static unsigned int SDATA_P1(idxErr_) = 0;
    if((m4b_cntTask1ms & 0x3) == 0)
        m4b_injectError(&idxErr_);

    return 0;

} /* End of task1ms */



/**
 * OS task function, cyclically activated every Millisecond. Used to clock the step
 * functions of our I/O drivers.\n
 *   This task is run in supervisor mode and it has no protection. The implementation
 * belongs into the sphere of trusted code.
 *   @param taskParam
 * A variable task parameter. Here just used for testing.
 */
static void taskOs1ms(uint32_t taskParam ATTRIB_DBG_ONLY)
{
    assert(taskParam == 0);

    /* Make spinning of the task observable in the debugger. */
    ++ m4b_cntTaskOs1ms;

    /** Regularly called step function of the I/O driver. */
    lbd_osTask1ms();

#if TASKS_PRODUCE_GROUND_LOAD == 1
    /* Produce a bit of CPU load. This call simulates some true application software. */
    del_delayMicroseconds(/* fullLoadThisNoMicroseconds */ 75 /* approx. 7.5% load */);
#endif

    /* Test button input: The current status is echoed as LED status. */
    lbd_osSetLED(lbd_led_5_DS6,  /* isOn */ lbd_osGetButton(lbd_bt_button_SW2));
              
