PeterVranken/DEVKIT-MPC5748G/samples/safe-RTOS/code/application/triCore/Z4B/m4b_mainZ4B.c
    /* Communicate the current number of recognized failures to the reporting task running
       on the boot core. */
    m4b_cntTaskFailuresP1 = rtos_getNoTotalTaskFailure(pidTask1ms);
    m4b_cntActivationLossFailures = rtos_getNoActivationLoss(idEvProc1ms);

    static int SBSS_P1(cntIsOn_) = 0;
    if(++cntIsOn_ >= 500)
        cntIsOn_ = -500;
    lbd_osSetLED(lbd_led_1_DS10, /* isOn */ cntIsOn_ >= 0);
    
} /* End of taskOs1ms */



/**
 * Here, on the second core we have a safe-RTOS running with full error catching
 * capabilities. We can try injecting some severe errors and expect the software on this
 * core to still run stable.\n
 *   Each invokation of this function injects an error and the calling user task will be
 * aborted. The function doesn't normally return but sometimes it may.
 *   @param[in,out] pIdxErr
 * The state of the function by reference. Actually a counter, which is incremented
 * (cyclically) at every function invocation and which has the meaning of the kind of
 * error, which is injected. Prior to the very first call of the function the counter * \a
 * pIdxErr should be set to zero.
 *   @remark
 * Despite of error catching, we need to take care, what we do. On the boot core, the
 * sample application "basicTest" is running. It injects errors, too, and looks at the
 * system reaction. A supervior task halts excution if something unexpected happens. An
 * unexpected thing can easily be a failure additional to those expected. If several cores
 * run safe-RTOS then they share the processes. Our failure injecting task belongs to
 * process 1 and on the boot core this process must not report any failures. Therefore we
 * can only inject errors, which are known to not harm any task on the boot core and
 * belonging to the same process. This means in particular that we must not do anything
 * which corrupts the memories of the process, which includes provoking straying tasks,
 * e.g., by corrupted stack memories or altered user accessible CPU registers.
 */
void m4b_injectError(unsigned int * const pIdxErr)
{
    /* Evaluation and increment of counter need to be done prior to the switch case: We
       will not reach the end of the switch statement any more. */
    const unsigned int idxErr = *pIdxErr;
    if(idxErr < 6)
        *pIdxErr = idxErr+1;
    else
        *pIdxErr = 0;

    switch(idxErr)
    {
    case 0:
        /* No error. */
        break;
    
    case 1:
        /* Illegal instruction. */
        rtos_osGetIdxCore();
        break;
    
    case 2:
        /* Modify instance pointer. */
        asm volatile ("mtspr 275, %%r1\n\t" ::: /* Clobbers */ "memory");
        break;
    
    case 3:
        /* Abort task execution (without reporting an error). */
        rtos_terminateTask(0);
        break;
    
    case 4:
        /* Abort task execution (with reporting an error). */
        rtos_terminateTask(-1);
        break;
    
    case 5:
        /* Access some peripheral. */
        lbd_osSetLED(lbd_led_7_DS4, /* isOn */ true);
        break;
    
    case 6:
    {
        /* Access an other process' memory. */
        extern uint8_t ld_stackStartOSCore0[0], ld_stackEndOSCore0[0];
        memset( /* address */ ld_stackStartOSCore0
              , /* value */ 0
              , /* noBytes */ (uintptr_t)ld_stackEndOSCore0 - (uintptr_t)ld_stackStartOSCore0
              );
        break;
    }

    default:
        assert(false);
    }
} /* End of m4b_injectError */




/**
 * Test of LED and button driver: This callback is invoked on every state change of any of
 * the supported (two) buttons.
 *   @return
 * The function always returns zero (no error).
 *   @param PID
 * PID of process, which is registered for the callback.
 *   @param buttonState
 * Current state of both buttons and changes in the instance of calling. See enum
 * lbd_buttonStateMask_t for details.
 *   @remark
 * This function must never be called directly. It has been made public for the only reason
 * that the boot core needs to know it for the initialization call of the I/O driver.
 */
int32_t m4b_onButtonChangeCallback(uint32_t PID ATTRIB_UNUSED, uint8_t buttonState)
{
    /* Test button input: The current status is echoed as LED status. */
    if((buttonState & lbd_btStMask_btnSw1_down) != 0)
        lbd_setLED(lbd_led_6_DS5,  /* isOn */ true);
    else if((buttonState & lbd_btStMask_btnSw1_released) != 0)
        lbd_setLED(lbd_led_6_DS5,  /* isOn */ false);
              
    return 0;    

} /* End of m4b_onButtonChangeCallback */



/**
 * C entry function main. Is used for the second core running safe-RTOS. It depends on
 * configuration macros #RTOS_RUN_SAFE_RTOS_ON_CORE_1 and #RTOS_RUN_SAFE_RTOS_ON_CORE_2,
 * which one that is.
 *   @param noArgs
 * Number of arguments in \a argAry. Is actually always equal to one.
 *   @param argAry
 * Array of string arguments to the function. Actually, always a single string which equals
 * the name of the core, which is started.
 *   @remark
 * Actually, the function is a _Noreturn. We don't declare it as such in order to avoid a
 * compiler warning. 
 */
void /* _Noreturn */ m4b_mainZ4B( int noArgs ATTRIB_DBG_ONLY
                                , const char *argAry[] ATTRIB_DBG_ONLY
                                )
{
    assert(noArgs == 1  &&  strcmp(argAry[0], "Z4B") == 0);
            
#if 0 /* Here, on the second core, we must not make use of the serial output. It is
         basically alright to make use of the sio API but blocking by busy wait is involved
         with hard to predict impact on the RTOS timing. Moreover, the use of the C library
         is strongly deprecated - it is not proven that it has been configured and compiled
         for multi-core use. Simple functions without static data will properly work, but
         nothing can be said about the printf and stream function families, which make use
         of buffers and heap. */

    /* Demonstrate the use of the serial interface. Note, the function is never blocking
       and we have left it for a long time before the character are visible in the console
       window. Never blocking: If the buffer has not enough space then an according number
       of characters is dropped rather than the function waiting for the buffer becoming
       empty. */
    #define GREETING "Hello World\r\n"
    sio_osWriteSerial(GREETING, /* noBytes */ sizeof(GREETING)-1);
    fputs("fputs saying " GREETING, stdout);
    printf("printf saying %s", GREETING);
    #undef GREETING
#endif    

    /* Register the process initialization tasks. */
    bool initOk = true;
    if(rtos_osRegisterInitTask(taskInitProcess, /* PID */ 1, /* tiTaskMaxInUS */ 1000)
       != rtos_err_noError
      )
    {
        initOk = false;
    }

    /* Create the events that trigger application tasks at the RTOS. Note, we do not really
       respect the ID, which is assigned to the event by the RTOS API rtos_osCreateEventProcessor().
       The returned value is redundant. This technique requires that we create the events
       in the right order and this requires in practice a double-check by assertion - later
       maintenance errors are unavoidable otherwise. */
    unsigned int idEvProc;
    if(rtos_osCreateEventProcessor
                        ( &idEvProc
                        , /* tiCycleInMs */               1
                        , /* tiFirstActivationInMs */     10
                        , /* priority */                  prioEv1ms
                        , /* minPIDToTriggerThisEvProc */ RTOS_EVENT_PROC_NOT_USER_TRIGGERABLE
                        , /* timerUsesCountableEvents */  false
                        , /* taskParam */                 0
                        )
       == rtos_err_noError
      )
    {
        assert(idEvProc == idEvProc1ms);

        if(rtos_osRegisterOSTask(idEvProc1ms, taskOs1ms) != rtos_err_noError)
            initOk = false;

        if(rtos_osRegisterUserTask( idEvProc1ms
                                  , task1ms
                                  , pidTask1ms
                                  , /* tiTaskMaxInUs */ 0
                                  )
           != rtos_err_noError
          )
        {
            initOk = false;
        }
    }
    else
        initOk = false;

    if(rtos_osCreateSwTriggeredEventProcessor
                        ( &idEvProc
                        , /* priority */                  prioEvNotificationFromZ2
                        , /* minPIDToTriggerThisEvProc */ RTOS_EVENT_PROC_NOT_USER_TRIGGERABLE
                        )
       == rtos_err_noError
      )
    {
        assert(idEvProc == idEvProcNotificationFromZ2);

        if(rtos_osRegisterUserTask( idEvProcNotificationFromZ2
                                  , taskNotificationFromZ2
                                  , pidTaskNotificationFromZ2
                                  , /* tiTaskMaxInUs */ 0
                                  )
           != rtos_err_noError
          )
        {
            initOk = false;
        }
    }
    else
        initOk = false;

    if(rtos_osCreateSwTriggeredEventProcessor
                        ( &idEvProc
                        , /* priority */                  prioEvNotificationFromZ4A
                        , /* minPIDToTriggerThisEvProc */ RTOS_EVENT_PROC_NOT_USER_TRIGGERABLE
                        )

       == rtos_err_noError
      )
    {
        assert(idEvProc == idEvProcNotificationFromZ4A);

        if(rtos_osRegisterUserTask( idEvProcNotificationFromZ4A
                                  , taskNotificationFromZ4A
                                  , pidTaskNotificationFromZ4A
                                  , /* tiTaskMaxInUs */ 0
                                  )
           != rtos_err_noError
          )
        {
            initOk = false;
        }
    }
    else
        initOk = false;

    /* The last check ensures that we didn't forget to register a task. */
    assert(idEvProc == noRegisteredEvProcs-1);

    /* Initialize the RTOS kernel. The global interrupt processing is resumed if it
       succeeds. The step involves a configuration check. We must not startup the SW if the
       check fails. */
    if(!initOk ||  rtos_osInitKernel() != rtos_err_noError)
        while(true)
            ;

    /* Only after initialization of the RTOS, we start the next core. This is because the
       function to register the interrupt handlers at the global, shared interrupt
       controller is not cross-core safe under all circumstances. This was we simply avoid
       any race condition. */
    syc_startSecondaryCore(/* idxCore */ 2 /* Z2 */, mz2_mainZ2);

    /* The code down here becomes the idle task of the RTOS. We enter an infinite loop,
       where some background can be placed. */
    while(true)
    {
        /* Compute the average CPU load. Note, this operation lasts about 1s and has a
           significant impact on the cycling speed of this infinite loop. Furthermore, it
           measures only the load produced by the tasks and system interrupts but not that
           of the rest of the code in the idle loop. */
        m4b_cpuLoadZ4B = gsl_osGetSystemLoad();

        /* Communicate some status information to the reporting task running on the boot
           core. */
        m4b_stackReserveP1 = rtos_getStackReserve(pidTask1ms);
        m4b_stackReserveOS = rtos_getStackReserve(pidOs);
        
        static bool SBSS_OS(isOn_) = false;
        lbd_osSetLED(lbd_led_3_DS8, isOn_ = !isOn_);

        /* Make spinning of the idle task observable in the debugger. */
        ++ m4b_cntTaskIdle;

    } /* End of inifinite idle loop of RTOS. */

} /* End of m4b_mainZ4B */
